Revit 2027 API
FabricationPartBrowserChangedEventArgs.GetRequiredFabricationPartTypeIds Method
 Returns set of required fabrication part types in use in routing solution mode.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetRequiredFabricationPartTypeIds()
Public Function GetRequiredFabricationPartTypeIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetRequiredFabricationPartTypeIds()
member GetRequiredFabricationPartTypeIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The set of ElementIds for for required fabrication part types that is in use in routing solution mode.
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace